package dictionary

import (
	"generateScript/models"
	"math/rand"
)

func GenerateResume() *models.Resume {
	title, main := generateTitle()
	result := &models.Resume{
		Title:             title,
		ExperienceInYears: experience[rand.Int()%len(experience)],
		Salary:            uint(rand.Uint64()%2900+100) * 100,
		Location:          generateLocation(),
		Description:       resumeDesc[main],
	}
	return result
}

var resumeDesc = map[string]string{
	"Психолог":           "Имею специализации в психологии: детско-родительские отношения, диагностика и коррекция эмоционального состояния, работа с детьми, подростками, а так семейные отношения: консультирование супружеских пар, диагностика и коррекция эмоционального состояния с помощью кинезиологических техник, а также методики Резет-1, Резет-2.",
	"Golang-разработчик": "Последние полгода интенсивно изучаю этот язык программирования и работаю над разработкой учебного проекта в рамках Образовательного курса VK в МГТУ. Код Вы можете посмотреть по ссылке: https://github.com/go-park-mail-ru/2022_2_Technopanki . Работаю с Docker, Redis, PostgreSQL, gRPC и активно изучаю новые технологии, так как в настоящий момент проект находится в стадии разработки. Имею опыт работы с С++, писал проект с использованием фреймворка Qt, изучал основные алгоритмы и структуры данных, регулярно работаю с системой контроля версий git.",
	"С++ разработчик":    "Студент, начинающий разработчик. Имею опыт работы (учебный проект) с С++ с использованием Boost и Qt",
	"С-разработчик":      "Студент, начинающий разработчик. Имею опыт работы (учебный проект) с С и Assembler",
	"С#-разработчик":     "Студент, начинающий разработчик. Имею опыт работы (учебный проект) с .NET",
	"Java-разработчик":   "2 года разрабатывал приложения с использованиям фреймворка Spring. Полгода опыта коммерческой разработке на Kotlin",
	"Python-разработчик": "Выпускник образовательного проекта VK в МГТУ направления ML",
	"PHP-разработчик":    "Студент, начинающий разработчик. Имею опыт работы (учебный проект) с Laravel",
	"Perl-разработчик":   "Студент, начинающий разработчик. Имею опыт работы (учебный проект) с Perl",
	"Тестировщик":        "Ссылка на гитхаб: ***",
	"Фитнес-тренер":      "Мастер-спорта по тайскому боксу, опыт работы в фитнес-клубах 3 года",
	"Преподаватель":      "Опыт работы преподавателем по классу фортепиано 12 лет, опыт проведения индивидуальных занятий 5 лет",
	"Воспитатель":        "Педагогическое образование. Работал в детском саду \"Солнце\" с 1999 по 2017",
	"Уборщик":            "Опыт работы: 5 лет",
	"Грузчик":            "Опыт работы: 7 лет",
	"Дизайнер":           "Диплом The New School, опыт работы в Hoff текстильным дизайнером 2 года. Портфолио можете посмотреть по ссылке: ***",
	"Финансист":          "Опыт работы 2 года: Специалист по аутентификации клиентов в цифровых каналах в Управлении «Единая клиентская идентификация» (финансист): исследую проблемы, с которыми сталкивается клиент;  изучаю статистику по жалобам и обращениям; выявляю проблемы в процессах банка, которые влияют на качество аутентификации в цифровом канале;\n разрабатываю рекомендации по улучшениям;\n выявляю зависимости между улучшениями и снижениями количества жалоб;\n подготавливаю материалы для презентации результатов;\n контролирую и отслеживаю изменения в КПЭ по качеству;\n оцениваю эффект от реализации проектов и как они влияют на качество клиентского опыта.",
	"Переводчик":         "Языки: английский C2, немецкий и арабский C1, турецкий B2",
	"Водитель":           "Водительский стаж 10 лет. Опыт работы 3 года в такси, бизнес-класс",
	"Дрессировщик":       "Опыт работы 3 года в данной сфере",
	"Продавец":           "Работаю в данной сфере 10 лет",
	"Сварщик":            "Опытный,ответственный,без вредных привычек",
	"Инженер":            "Опыт работы инженером 12 лет: \nРабота с заводами – поставщиками оборудования (Германия, Франция, Италия, Китай, Корея).\n\n Согласование и решение технических вопросов с инженерами заводов на английском языке по электронной почте.\n\n Разработка технических заданий по проектам, согласование их с производственными службами.\n\n Взаимодействие с поставщиками оборудования на всех этапах реализации проекта.\n",
}
