package dictionary

var prefixTitle = []string{
	"Младший ",
	"Старший ",
	"Начинающий ",
	"", "", "", "", "",
}

var mainTitle = []string{
	"Психолог",
	"Golang-разработчик",
	"С++ разработчик",
	"С-разработчик",
	"С#-разработчик",
	"Java-разработчик",
	"Python-разработчик",
	"PHP-разработчик",
	"Perl-разработчик",
	"Тестировщик",
	"Фитнес-тренер",
	"Преподаватель",
	"Воспитатель",
	"Уборщик",
	"Грузчик",
	"Финансист",
	"Дизайнер",
	"Переводчик",
	"Менеджер по продажам",
	"Водитель",
	"Дрессировщик",
	"Продавец",
	"Сварщик",
	"Инженер",
}
